bekencorp/bk_idk/middleware/soc/bk7234/soc/gpio_map.h
#define LCD_RGB_G0_FUNC 			(GPIO_DEV_LCD_G0)
#define LCD_RGB_G1_FUNC 			(GPIO_DEV_LCD_G1)
#define LCD_RGB_G2_FUNC 			(GPIO_DEV_LCD_G2)
#define LCD_RGB_G3_FUNC 			(GPIO_DEV_LCD_G3)
#define LCD_RGB_G4_FUNC 			(GPIO_DEV_LCD_G4)
#define LCD_RGB_G5_FUNC 			(GPIO_DEV_LCD_G5)
#define LCD_RGB_G6_FUNC 			(GPIO_DEV_LCD_G6)
#define LCD_RGB_G7_FUNC 			(GPIO_DEV_LCD_G7)

#define LCD_RGB_B0_FUNC 			(GPIO_DEV_LCD_B0)
#define LCD_RGB_B1_FUNC 			(GPIO_DEV_LCD_B1)
#define LCD_RGB_B2_FUNC 			(GPIO_DEV_LCD_B2)
#define LCD_RGB_B3_FUNC 			(GPIO_DEV_LCD_B3)
#define LCD_RGB_B4_FUNC 			(GPIO_DEV_LCD_B4)
#define LCD_RGB_B5_FUNC 			(GPIO_DEV_LCD_B5)
#define LCD_RGB_B6_FUNC 			(GPIO_DEV_LCD_B6)
#define LCD_RGB_B7_FUNC 			(GPIO_DEV_LCD_B7)

#define LCD_RGB_CLK_FUNC 			(GPIO_DEV_LCD_CLK)
#define LCD_RGB_DISP_FUNC 			(GPIO_DEV_LCD_DISP)
#define LCD_RGB_HSYNC_FUNC 			(GPIO_DEV_LCD_HSYNC)
#define LCD_RGB_VSYNC_FUNC 			(GPIO_DEV_LCD_VSYNC)
#define LCD_RGB_DE_FUNC 			(GPIO_DEV_LCD_DE)


#define LCD_QSPI_PWM_BACKLIGHT		(PWM_ID_2)
#define LCD_RGB_PWM_BACKLIGHT		(PWM_ID_1)

/*
 * LCD MCU GPIO MAP
 */
#define LCD_MCU_D0_PIN 				(GPIO_47)
#define LCD_MCU_D1_PIN 				(GPIO_46)
#define LCD_MCU_D2_PIN 				(GPIO_45)
#define LCD_MCU_D3_PIN 				(GPIO_44)
#define LCD_MCU_D4_PIN 				(GPIO_43)
#define LCD_MCU_D5_PIN 				(GPIO_42)
#define LCD_MCU_D6_PIN 				(GPIO_41)
#define LCD_MCU_D7_PIN 				(GPIO_40)
#define LCD_MCU_D8_PIN 				(GPIO_21)
#define LCD_MCU_D9_PIN 				(GPIO_20)
#define LCD_MCU_D10_PIN 			(GPIO_19)
#define LCD_MCU_D11_PIN 			(GPIO_18)
#define LCD_MCU_D12_PIN 			(GPIO_17)
#define LCD_MCU_D13_PIN 			(GPIO_16)
#define LCD_MCU_D14_PIN 			(GPIO_15)
#define LCD_MCU_D15_PIN 			(GPIO_14)
#define LCD_MCU_D16_PIN 			(GPIO_48)
#define LCD_MCU_D17_PIN 			(GPIO_49)
#define LCD_MCU_RDX_PIN 		 	(GPIO_26)
#define LCD_MCU_WRX_PIN 		 	(GPIO_25)
#define LCD_MCU_RSX_PIN 		 	(GPIO_24)
#define LCD_MCU_RESET_PIN 		 	(GPIO_23)
#define LCD_MCU_CSX_PIN 		 	(GPIO_22)

#define LCD_MCU_D0_FUNC 			(GPIO_DEV_LCD_B3)
#define LCD_MCU_D1_FUNC 			(GPIO_DEV_LCD_B4)
#define LCD_MCU_D2_FUNC 			(GPIO_DEV_LCD_B5)
#define LCD_MCU_D3_FUNC 			(GPIO_DEV_LCD_B6)
#define LCD_MCU_D4_FUNC 			(GPIO_DEV_LCD_B7)
#define LCD_MCU_D5_FUNC 			(GPIO_DEV_LCD_G2)
#define LCD_MCU_D6_FUNC 			(GPIO_DEV_LCD_G3)
#define LCD_MCU_D7_FUNC 			(GPIO_DEV_LCD_G4)
#define LCD_MCU_D8_FUNC 			(GPIO_DEV_LCD_R5)
#define LCD_MCU_D9_FUNC 			(GPIO_DEV_LCD_R6)
#define LCD_MCU_D10_FUNC 			(GPIO_DEV_LCD_R7)
#define LCD_MCU_D11_FUNC 			(GPIO_DEV_LCD_VSYNC)
#define LCD_MCU_D12_FUNC 			(GPIO_DEV_LCD_HSYNC)
#define LCD_MCU_D13_FUNC 			(GPIO_DEV_LCD_DE)
#define LCD_MCU_D14_FUNC 			(GPIO_DEV_LCD_DISP)
#define LCD_MCU_D15_FUNC 			(GPIO_DEV_LCD_CLK)
#define LCD_MCU_D16_FUNC 			(GPIO_DEV_LCD_R2)
#define LCD_MCU_D17_FUNC 			(GPIO_DEV_LCD_R1)
#define LCD_MCU_RDX_FUNC 		 	(GPIO_DEV_LCD_G5)
#define LCD_MCU_WRX_FUNC 		 	(GPIO_DEV_LCD_G6)
#define LCD_MCU_RSX_FUNC 		 	(GPIO_DEV_LCD_G7)
#define LCD_MCU_RESET_FUNC 		 	(GPIO_DEV_LCD_R3)
#define LCD_MCU_CSX_FUNC 		 	(GPIO_DEV_LCD_R4)

/*
* AUDIO PA GPIO MAP
*/
#define AUD_DAC_PA_CTRL_GPIO		(GPIO_39)
#define AUD_DAC_PA_ENABLE_LEVEL		(1)

/*
* VIDEO PA GPIO MAP
*/
// LCD AND SD POWER CTRL
#define LCD_LDO_CTRL_GPIO                  (GPIO_13)
#define LCD_LDO_CTRL_ACTIVE_LEVEL          (1)

#define SDCARD_LDO_CTRL_GPIO               (GPIO_13)
#define SDCARD_LDO_CTRL_ACTIVE_LEVEL       (1)

// LCD BACKLIGHT CTRL
#define LCD_BACKLIGHT_CTRL_GPIO            (GPIO_7)
#define LCD_BACKLIGHT_CTRL_ACTIVE_LEVEL    (1)

#if CONFIG_GPIO_WAKEUP_SUPPORT
#define GPIO_STATIC_WAKEUP_SOURCE_MAP  \
	{\
		/*{GPIO_6, GPIO_INT_TYPE_LOW_LEVEL},*/ \
		{GPIO_10, GPIO_INT_TYPE_FALLING_EDGE},\
		/*{GPIO_40, GPIO_INT_LEVEL_LOW},*/ \
	}

#endif

#ifdef __cplusplus
}
#endif
